[
  {
    "text": "Class time will be used for many relevant activities, including lectures, discussions, presentations, time to ask questions, exams, and evaluations of work."
  },
  {
    "text": "As such, class attendance is required every class day."
  },
  {
    "text": "There will be multiple methods of taking attendance, such as quiz or in class activity."
  },
  {
    "text": "Assignments involve the application of a supplied a writeup with all requirements and necessary materials."
  },
  {
    "text": "All assignments are submitted in phases, each worth a portion of the grade."
  },
  {
    "text": "It is suggested that students wait the for the feedback on each phase before starting the next, to implement instructor suggestions."
  },
  {
    "text": "The phases are as follows:"
  },
  {
    "text": "Problem Setup (10 points)"
  },
  {
    "text": "I want to eat some of Moscola's pizza."
  },
  {
    "text": "File structure"
  },
  {
    "text": "Documentation (draft)"
  },
  {
    "text": "Demonstration of a start to the solution"
  },
  {
    "text": "Shown to instructor in class for credit"
  },
  {
    "text": "First Draft (10 points)"
  },
  {
    "text": "Complete program with full documentation in Appendix"
  },
  {
    "text": "Output examples (at least 3) in Appendix"
  },
  {
    "text": "Template sections included but no text required (other than program and output) Submitted to Canvas by Friday for grading over the weekend"
  },
  {
    "text": "Final Draft (20 points)"
  },
  {
    "text": "All design template sections with proper paragraphs"
  },
  {
    "text": "Appendix contains program"
  },
  {
    "text": "Appendix contains sufficient output examples to demonstrate all requirements, including user error"
  },
  {
    "text": "Limited to 10 pages - compress or remove irrelevant content as necessary"
  },
  {
    "text": "Submitted to Canvas by Wednesday for grading over the weekend (Friday if student provides a printout)"
  },
  {
    "text": "Can resubmit for full credit"
  },
  {
    "text": "Video Demonstration (20 points)"
  },
  {
    "text": "Introduction - 30 seconds"
  },
  {
    "text": "Code review - 90-180 seconds"
  },
  {
    "text": "Output review - 90-180 seconds"
  },
  {
    "text": "Conclusion - 30 seconds"
  },
  {
    "text": "Overall: 4 to 6 minutes"
  },
  {
    "text": "Submitted to Canvas by Friday for grading over the weekend"
  },
  {
    "text": "Can resubmit for full credit"
  },
  {
    "text": "Final Project and Evaluations"
  },
  {
    "text": "Upon the end of the semester, students will complete and demonstrate a final project, combining the concepts an material discussed in class into a large project."
  },
  {
    "text": "Exact specifications will be given later in the semester."
  },
  {
    "text": "During finals week, students will evaluate the finished project demos."
  },
  {
    "text": "Students may work in groups of two or three on th final project, but not in a group of four or more."
  },
  {
    "text": "Class Kudos"
  },
  {
    "text": "YCP provides a kudos system with the advising software."
  },
  {
    "text": "While the system works, it can be cumbersome to use, and does not make sense for some rewards."
  },
  {
    "text": "Class kudos is not extra credit, but can play a role in determining the final grade."
  },
  {
    "text": "The instructor will keep a separate kudos for course-related decisions that benefit the class overall."
  },
  {
    "text": "Examples of class kudos are helping the teacher with classroom operations, representation at an Open House event, help organizing events such as Design Week or YCPHacks, and providing material or insight."
  },
  {
    "text": "Alert the instructor if some volunteering activity may also apply for class kudos."
  },
  {
    "text": "The primary factor of a student's success Weekly grades will use the A-B-C-D-F scale, and are only an indication of the overall success so far."
  },
  {
    "text": "Students will receive a gradeslip each week in class."
  },
  {
    "text": "Each gradeslip will contain the current grade up to that point."
  },
  {
    "text": "These weekly grades will be recorded and used"
  },
  {
    "text": "to determine the final grade."
  },
  {
    "text": "When calculating the weekly letter grade, percentages are"
  },
  {
    "text": "rounded up to the nearest whole percent (i."
  },
  {
    "text": "79.2% is brought up to 80%)."
  },
  {
    "text": "The grade"
  },
  {
    "text": "scale table to the right will be used."
  },
  {
    "text": "For security purposes, grades are not kept on Canvas;"
  },
  {
    "text": "consult the gradeslip for current grade status."
  },
  {
    "text": "Students are expected to review their gradeslip each week to ensure for accuracy."
  },
  {
    "text": "Maximum Potential Grade"
  },
  {
    "text": "Comic books are awesome"
  },
  {
    "text": "It is the student responsibility to maintain their current weekly grade."
  },
  {
    "text": "Any weekly grade of F is recorded, starting with week 6."
  },
  {
    "text": "Students with only a few weekly grades of F can still earn an A as a final grade in class, but a consistent weekly failing weekly grade will bring down a student's maximum potential grade."
  },
  {
    "text": "If the weekly grade drops to an F and stays for multiple weeks, the student's maximum grade potential drops."
  },
  {
    "text": "After eight weekly grades of F, there is no way to pass the class no matter what is submitted."
  },
  {
    "text": "Consult the following table"
  },
  {
    "text": "I love teaching."
  },
  {
    "text": "Being a teacher is more than what I do or how I pay the bills;"
  },
  {
    "text": "it is who I am."
  },
  {
    "text": "There are very few professions more honorable, or more satisfying, than to help others prepare for their lives."
  },
  {
    "text": "I teach with one basic practice makes perfect."
  },
  {
    "text": "The only way one learns and retains knowledge is to use it, not once, but multiple times."
  },
  {
    "text": "must learn how to learn on their own."
  },
  {
    "text": "Learning does not come without hard work and effort."
  },
  {
    "text": "I do not give out good grades easily."
  },
  {
    "text": "Even to get a B in m requires time and some elbow grease."
  },
  {
    "text": "I want my A-students to truly know they earned their grade."
  },
  {
    "text": "I do this by re many assignments and expecting a lot out of my students."
  },
  {
    "text": "In my mind, a B is a perfectly acceptable grade to give and the students wishing an A will have to put forth that much more effort."
  },
  {
    "text": "My teaching approach changes with each semester."
  },
  {
    "text": "I am constantly experimenting with new and innovative meth teaching and organizing classroom activities."
  },
  {
    "text": "Those that work are improved upon and used again in future classe that do not are either reworked or abandoned."
  },
  {
    "text": "My methods consist of what I feel are the best techniques for any g"
  },
  {
    "text": "situation."
  },
  {
    "text": "I teach towards multiple disciplines."
  },
  {
    "text": "I give my students the abilities they need in order to succeed in the real wor They improve their writing skills by including proper program and user documentation."
  },
  {
    "text": "They develop their prese skills by creating video screencaptures of their work."
  },
  {
    "text": "The purpose of education and learning is only partially driv prospect of a future occupation."
  },
  {
    "text": "It is important to realize that any academic pursuit is useful, not only in acquirin knowledge, but in understanding the world from a new perspective."
  },
  {
    "text": "I use class time and assignments as motivators towards learning a process."
  },
  {
    "text": "An ounce of proper motivation can pr amazing results."
  },
  {
    "text": "I allow students to decide for themselves what is important and relevant to their future."
  },
  {
    "text": "By allov students to create their own ideas and philosophies, it is the ultimate goal for my students to surpass my knowled their own discoveries."
  },
  {
    "text": "I observe every action and facial expression of my students."
  },
  {
    "text": "I can tell when they are angry, scared, bored, happy, relieved."
  },
  {
    "text": "Student emotions can give mountains of information, in regards to feedback, enjoyment, and effectiven lesson."
  },
  {
    "text": "The more I observe, the more I am able to adapt."
  },
  {
    "text": "This allows me to make last-minute changes to exams, plans, and assignments."
  },
  {
    "text": "Finally, I encourage honesty and equality."
  },
  {
    "text": "I grade based only on the quality of work submitted."
  },
  {
    "text": "I expect hard wor of all students, regardless of past experience or current availability."
  },
  {
    "text": "Race, sex, prior history, political views, or pe opinion of me has no effect on how I grade."
  },
  {
    "text": "It will be solely determined by the quality of the work turned in and performance on the exams."
  },
  {
    "text": "I am a teacher."
  },
  {
    "text": "I dream of someday talking again to my students, years after graduation, holding successful and productive careers."
  },
  {
    "text": "Teaching Experience"
  },
  {
    "text": "York College of Pennsylvania (instructor of computer science, 2022 to present)"
  },
  {
    "text": "University of Northern Colorado (lecturer of computer science and mathematics, 2014-2022)"
  },
  {
    "text": "University of Missouri (instructor of computer science, 2013-2014)"
  },
  {
    "text": "Florida State College at Jacksonville (assistant professor of information technology, 2012-2013)"
  },
  {
    "text": "Art Institute of Jacksonville (instructor of web design, graphic design, mathematics, interior design, and culinary, 2009-2012)"
  },
  {
    "text": "Kent State University (graduate student in computer science, 2005-2009)"
  },
  {
    "text": "Kansas City Missouri School District (high-school mathematics teacher, 2003-2005)"
  },
  {
    "text": "Park University (assistant professor of computer science, 2000-2003)"
  },
  {
    "text": "Bowling Green State University (instructor of computer science, 1996-2000)"
  },
  {
    "text": "Bowling Green State University (graduate student in computer science and seminar coordinator/instructor for computer services, 1994-1996)"
  },
  {
    "text": "Zeller Feller"
  },
  {
    "text": "Education"
  },
  {
    "text": "Masters of Science in Computer Science (Bowling Green State University, 1996)"
  },
  {
    "text": "Bachelors of Science in Mathematics and Computer Science (Bowling Green State University, 1992)"
  },
  {
    "text": "High School Diploma (Bowling Green High School, 1987)"
  },
  {
    "text": "Research Interests"
  },
  {
    "text": "Ethics and Impact of Artificial Intelligence on Society"
  },
  {
    "text": "K-12 Education of Computer Science"
  },
  {
    "text": "Algorithms"
  },
  {
    "text": "Experimental Mathematics"
  },
  {
    "text": "Cybersecurity (social weaknesses in security protocols)"
  },
  {
    "text": "Bioinformatics"
  },
  {
    "text": "Graph Theory"
  },
  {
    "text": "Statistics and Data Mining"
  },
  {
    "text": "Geometric Modeling"
  },
  {
    "text": "Combinatorics of Puzzle and Game Strategy"
  },
  {
    "text": "Hobbies"
  },
  {
    "text": "Comic books (25,000 of them!)"
  },
  {
    "text": "River exploration and wilderness survival"
  },
  {
    "text": "Firespinning"
  },
  {
    "text": "Roleplaying games"
  },
  {
    "text": "Techno music"
  },
  {
    "text": "Cooking, culinary arts (took 6 classes)"
  },
  {
    "text": "Cat: Professor X (\"Exy\")"
  },
  {
    "text": "Drumming/percussion"
  },
  {
    "text": "Color: dark purple"
  },
  {
    "text": "Programming language: Python"
  },
  {
    "text": "Cartoon character: Wile E."
  },
  {
    "text": "Coyote"
  },
  {
    "text": "Superhero: Spider-Man"
  },
  {
    "text": "Food: Tortellini, Philly-steak sandwich, panini, shaved ice"
  },
  {
    "text": "Board games: Othello, Checkers, Parcheesi, Backgammon, Risk, Scrabble"
  },
  {
    "text": "Movies:"
  },
  {
    "text": "Airplane!"
  },
  {
    "text": "Last of the Mohicans"
  },
  {
    "text": "Cast Away"
  },
  {
    "text": "Captain America: Civil War"
  },
  {
    "text": "Sports to play: racquetball, badminton, and ping pong"
  },
  {
    "text": "Current Writing Projects"
  },
  {
    "text": "The Zeller Cellar"
  },
  {
    "text": ", by Dean Zeller."
  },
  {
    "text": "A collection of project proposals in software engineering, appropriate"
  },
  {
    "text": "for college-level software engineering courses."
  },
  {
    "text": "Students are free to use project proposals in their work,"
  },
  {
    "text": "and are encouraged to write their own submissions for inclusion in future versions."
  },
  {
    "text": "The Art of Proving"
  },
  {
    "text": ", by Dr."
  },
  {
    "text": "Richard Grassl and Dean Zeller."
  },
  {
    "text": "An investigation on how to use programming"
  },
  {
    "text": "and visual diagrams to solve problems in mathematics."
  },
  {
    "text": "Published Spring 2021 through Amazon."
  },
  {
    "text": "Gems of Experimental Mathematics"
  },
  {
    "text": "An explanation of what experimental mathematics is, and various"
  },
  {
    "text": "problems with solutions to get students started."
  },
  {
    "text": "Python Before Java Library"
  },
  {
    "text": "A Java textbook that assumes reader is already familiar with Python."
  },
  {
    "text": "It"
  },
  {
    "text": "provides a side-by-side comparison between the functionality of Python and Java."
  },
  {
    "text": "The Doordash Adventure"
  },
  {
    "text": ", by Dean Zeller."
  },
  {
    "text": "A fictional story taking place in the near future, with the use of"
  },
  {
    "text": "artificial intelligence drones and robots just starting to become ubiquitous."
  },
  {
    "text": "The network of automated"
  },
  {
    "text": "devices are starting to develop a mind and personality of their own."
  },
  {
    "text": "The Adventures of Chopsticks the Ninja"
  },
  {
    "text": ", by Dean Zeller."
  },
  {
    "text": "The story of a young girl creating a superhero-"
  },
  {
    "text": "esque ninja persona to help deal with the trials and tribulations of the actual world, only to find society"
  },
  {
    "text": "will be getting much more complicated."
  },
  {
    "text": "Socialist/Capitalist Hybrid Involving Technology (or SCHIT) , by Dean Zeller."
  },
  {
    "text": "The advancement of"
  },
  {
    "text": "technology now allows for political concepts that were impossible or impractical before."
  },
  {
    "text": "AI and robot technology could be used to reshape society to handle difficult problems such as homelessness, hunger, and crime."
  },
  {
    "text": "It could redefine the concept of advertising and branding."
  },
  {
    "text": "If nothing else, it would make for a good story."
  },
  {
    "text": "The previous assignment was mostly about establishing the level of power and capabilities Al has in programming, along with some limitations."
  },
  {
    "text": "Entire software designs can be built within minutes by Al;"
  },
  {
    "text": "it single-most powerful tool Al has ever created, and the potential benefits are without limits."
  },
  {
    "text": "However..."
  },
  {
    "text": "Just because something is powerful, does not mean it should be used ubiquitously."
  },
  {
    "text": "The introduction of power on society will not come without its negative effects and downfalls."
  },
  {
    "text": "What are some reasons that could have reservations about using Al?"
  },
  {
    "text": "This assignment is about choosing one primary reason for a and discussion."
  },
  {
    "text": "Psychological - potential for addiction to Al, effects on child development and human relationships Environmental - amount of power and water used to maintain Al massive data centers"
  },
  {
    "text": "Existential - Al has the potential to destroy all humanity"
  },
  {
    "text": "Uneven Benefits - Al will put unlimited power in the hands that may not use it for good"
  },
  {
    "text": "Financial - Al will take a lot of jobs, and only those that use Al will remain"
  },
  {
    "text": "Motivational - even if Al works completely as planned, individual people could lose their purpose Political - military use of Al could have disastrous consequences"
  },
  {
    "text": "Personal"
  },
  {
    "text": "some people are just \"squeamish\" about using and communicating with Al Religious - certain religions may forbid use of Al technology (Amish)"
  },
  {
    "text": "Social Stability - introduction of Al will cause massive changes in societal norms Freedom - people should have the right not to use with Al, yet no legislation exists to protect this right Reality - Al can create the illusion of a reality, and any picture/video is now under suspect of Al genera"
  },
  {
    "text": "The group will research and discuss potential reasons one can detect Al-use in generated content, including pictures, videos, text, audio, and other forms."
  },
  {
    "text": "Background - Detecting Al"
  },
  {
    "text": "Al is now used every day, in entertainment, advertising, and communication."
  },
  {
    "text": "In the future, it will be a u in digital survival to know when something has been Al-generated."
  },
  {
    "text": "There is no legislation on alerting r fact that Al was used."
  },
  {
    "text": "This assignment is about discussing ways Al can be detected in various forms c communication."
  },
  {
    "text": "Pictures - Commonly Al is used to generate still-pictures."
  },
  {
    "text": "How can we tell if it is Al-generated?"
  },
  {
    "text": "Videos - Similar to pictures, the level of capability of Al-generated videos is limited."
  },
  {
    "text": "However, it is still lifelike and difficult to detect."
  },
  {
    "text": "Text - Al follows patterns when generating text."
  },
  {
    "text": "What are these patterns, and how can they be detecte"
  },
  {
    "text": "Audio - Probably the most difficult Al-generated content to detect, as humans are not as good with differentiating audio pieces."
  },
  {
    "text": "Can apply to verbal conversations or music."
  },
  {
    "text": "Other - What other ways can Al generate content?"
  },
  {
    "text": "How can one detect Al in this method?"
  },
  {
    "text": "Are you a dean dude or a zeller feller?"
  },
  {
    "text": "programming) AI has already started its impact on many fields."
  },
  {
    "text": "Due to its generative nature, many creative fields onc impossible to acclimate are well within our capabilities."
  },
  {
    "text": "This assignment is about demonstrating the cu of technology now that AI is involved."
  },
  {
    "text": "With all of the positive effects on society, there will be a compara number of negative effects as well."
  },
  {
    "text": "Page 1 of 11 AI-Based Therapy: The Good, The Bad, The Ugly, and What We Can Do Dean Zeller (dzeller@ycp."
  },
  {
    "text": "edu) York College of Pennsylvania Fall 2025 Abstract The following is a discussion on recently developed AI-based technology that claims to provide one-on one therapy for people."
  },
  {
    "text": "It is already in use by millions of all ages worldwide."
  },
  {
    "text": "The potential use and misuse of the technology should be discussed, understanding that there are multiple valid viewpoints of the situation."
  },
  {
    "text": "This paper discusses the “good” (what AI-therapy can provide), the “bad” (negative effects on the patient), the “ugly” (negative effects on society), and what we can do about it."
  },
  {
    "text": "Background The concept of an AI-based therapist is nothing new."
  },
  {
    "text": "The very first AI program in the 1950’s was Eliza, an AI-based chatting tool that uses therapy as a basis for conversation."
  },
  {
    "text": "The original version was not very good, and did not fool anybody for long."
  },
  {
    "text": "Users could quickly realize Eliza’s ability to converse was limited to simple text replacement tools."
  },
  {
    "text": "It was never meant to provide actual therapy, but to serve as a medium for demonstrating communication abilities (or lack thereof)."
  },
  {
    "text": "Meanwhile the situation is grim."
  },
  {
    "text": "Despite the need for good, qualified therapy going up, the number of counselors going into the field are going down."
  },
  {
    "text": "There is simply not enough human therapists to provide adequate counseling to meet the needs."
  },
  {
    "text": "While AI-therapy may have its (many) faults, if used properly it could still be used to help solve some problems."
  },
  {
    "text": "Introduction AI-based technologies are on the rise."
  },
  {
    "text": "Every field is attempting to make use of this new technology that can somehow understand spoken language and help make decisions."
  },
  {
    "text": "It is undeniable that AI provides capabilities that previously existed only in science fiction."
  },
  {
    "text": "AI can provide benefits of automation, decision making, and generation of content."
  },
  {
    "text": "However, the reverse is also true – the capabilities of AI can easily be used for what most would consider harmful to society."
  },
  {
    "text": "It is too powerful of an entity to stop, but we can learn how to use it to minimize negative impact."
  },
  {
    "text": "If society does not effectively adapt to this new technology, the potential for disaster is unimaginable."
  },
  {
    "text": "Recent research indicates that 28% of people surveyed use AI in some form of support as a personal therapist."
  },
  {
    "text": "This is just one survey."
  },
  {
    "text": "The appendix contains a brief description of four studies measuring this variable."
  },
  {
    "text": "(Ironically, this list was generated by AI, and later confirmed manually."
  },
  {
    "text": ") If this statistic is"
  },
  {
    "text": "propagated for the United States population, the result is in the millions."
  },
  {
    "text": "So obviously, there are many, many people that believe in the power of AI-therapy."
  },
  {
    "text": "At this point, any discussion of its effectiveness (or lack of) must include the understanding that millions of people are already using it to one degree or another."
  },
  {
    "text": "The saying goes “50 million Garth Brooks fans can’t be wrong."
  },
  {
    "text": "”"
  },
  {
    "text": "Without any approval process by the governing bodies, AI-therapy is in widespread use."
  },
  {
    "text": "Where do we go from here?"
  },
  {
    "text": "As with any controversial issue, there are multiple viewpoints."
  },
  {
    "text": "To make use of a most famous 70’s Clint Eastwood western, these viewpoints will be called “The Good, the Bad, and The Ugly”."
  },
  {
    "text": "A final viewpoint will be presented in an attempt to combine the advantages of the other three."
  },
  {
    "text": "“The Good” As with all other applications, the first thing to realize is the benefit it provides."
  },
  {
    "text": "We now have access to a conversational entity that will serve as a mental therapist."
  },
  {
    "text": "Great!"
  },
  {
    "text": "Wonderful!"
  },
  {
    "text": "How many people are unable to get mental help simply because they cannot afford it?"
  },
  {
    "text": "This opens the door for millions of people to get therapy where they simply could not get it before."
  },
  {
    "text": "It is free, easily accessible, and available 24 hours a day."
  },
  {
    "text": "For all its (many) faults, the advantages are undeniable."
  },
  {
    "text": "Imagine having direct access to a therapist any time any place to help with problems!"
  },
  {
    "text": "While the rest of this paper discusses the downfalls and potential ramifications of using an AI-based therapist, these advantages can make therapy available for those that simply cannot get it otherwise."
  },
  {
    "text": "Some theories may suggest an AI-therapist could be better than a human in certain circumstances, though these arguments are have not been thoroughly tested."
  },
  {
    "text": "“The Bad” Now we turn the discussion to the potential negative effects on the patient using AI-based therapy."
  },
  {
    "text": "It is almost comical how many serious items are on this particular list."
  },
  {
    "text": "Generally, professional therapists are appalled that this is even called “therapy”."
  },
  {
    "text": "• The AI-therapy is available for everyone, regardless of age, mental status, or capability to consent."
  },
  {
    "text": "• It is not a trained therapist."
  },
  {
    "text": "Without the training, the AI-therapist could be causing more harm to the patient than good."
  },
  {
    "text": "• There is no confidentiality agreement, so anything said could become public."
  },
  {
    "text": "• AI-Therapists depend on affirmation of the patients ideas, right or wrong."
  },
  {
    "text": "• The AI-therapist encourages actions that will not be beneficial to the patient."
  },
  {
    "text": "• An AI can “forget” all information covered with a software upgrade, losing all progress made so far."
  },
  {
    "text": "• There is very little research on the long-term effects of communicating with such an entity."
  },
  {
    "text": "• AI may not have the ability to portray and understand emotions And many others."
  },
  {
    "text": "Suffice to say, there are many potential negative effects from using AI-based therapy."
  },
  {
    "text": "But that will not stop the flood of people using it."
  },
  {
    "text": "“The Ugly” Which brings us to"
  },
  {
    "text": "The primary problem is this: there are many people that simply can not afford mental therapy."
  },
  {
    "text": "Even with insurance, therapy is costly."
  },
  {
    "text": "Meanwhile, there are not nearly enough licensed therapists to handle the wide range of mental problems people can face."
  },
  {
    "text": "Even those that really want a human therapist find it difficult to get one."
  },
  {
    "text": "What exactly are we to tell everyone that cannot afford therapy when they consider AI-based therapy?"
  },
  {
    "text": "Sure, it has the aforementioned problems, but it is free, widely accessible, and is an effective conversation entity."
  },
  {
    "text": "Are suffering people supposed to decide not to use AI-therapy, just because it “might” have some negative effects?"
  },
  {
    "text": "This is a system that integrates the training and emotional depth of a human with the availability and processing of AI."
  },
  {
    "text": "One possible solution is to create a hybrid human/AI therapy system."
  },
  {
    "text": "If properly written and maintained, a hybrid therapy system could take advantage of the individual benefits of human therapy with the accessibility of AI."
  },
  {
    "text": "The net affect would be that the emotional impact of the human therapist would be diluted due to the additional patients."
  },
  {
    "text": "If controlled, some dilution is acceptable."
  },
  {
    "text": "The use of ice cubes in soft drinks keeps them cold, but dilutes the drink."
  },
  {
    "text": "Are you a dean dude or a zeller feller?"
  },
  {
    "text": "A slightly diluted iced tea is still much better than a lukewarm iced tea."
  },
  {
    "text": "A little dilution of emotional impact can still be effective."
  },
  {
    "text": "What would be the components of such a system of therapy?"
  },
  {
    "text": "In a hybrid therapy system, the patient would have a human therapist as the primary decision maker."
  },
  {
    "text": "All important decisions would be made or approved by the human therapist."
  },
  {
    "text": "The patient and therapist would meet (hopefully face-to-face) every so often to keep both parties updated and review progress."
  },
  {
    "text": "It should be fully understood that the human is the true therapist."
  },
  {
    "text": "The AI component would be available to accentuate or enhance the therapy process."
  },
  {
    "text": "So how can the AI help in this situation?"
  },
  {
    "text": "The first thing is to establish that the AI-component is just a tool."
  },
  {
    "text": "It is available to record events, analyze feelings, and be available for traumatic situations that are more algorithmic to solve."
  },
  {
    "text": "Much of the communication will be one-way, with the AI simply guiding the conversation."
  },
  {
    "text": "The AI will be written to specifically not give therapy advice."
  },
  {
    "text": "The patient can use the AI to record significant events and summarize content for the therapist and patient to discuss later."
  },
  {
    "text": "The AI could also alert the human therapist if something happens to the patient that may need their direct attention."
  },
  {
    "text": "This would allow the therapist to be in control of the situation overall, while using AI for the accessible conversations needed immediately."
  },
  {
    "text": "It is understood that the human therapist would be making the important decisions about the therapy, but the AI-component would be available to help."
  },
  {
    "text": "Trauma therapy is far more algorithmic and appropriate for AI interaction, so some liberty can be given in these situations."
  },
  {
    "text": "For day-to-day use, the"
  },
  {
    "text": "happening."
  },
  {
    "text": "The AI-therapist provides only basic advice, as approved by her human therapist."
  },
  {
    "text": "The human and AI therapists keep in communication about Bonita’s progress, offering minor changes to the AI therapy protocol."
  },
  {
    "text": "One problem Bonita suffers from is a sense of pure loneliness and helplessness when a difficult decision comes at a time she cannot get help or advice from friends."
  },
  {
    "text": "She also feels if something important happens to her and nobody is around Nobody will remember it, and it might as well have never happened."
  },
  {
    "text": "The AI can simply serve as a listening device, recording her base emotions at the time of the occurrence."
  },
  {
    "text": "Depending on the situation, the AI may or may not provide direct advice on handling what to do next."
  },
  {
    "text": "In any case, the human-therapist can be made aware, and give the AI-component modified instructions to deal with the situation."
  },
  {
    "text": "Bonita gets to have someone to talk to immediately, rather than to wait until the next face-to-face session with the therapist."
  },
  {
    "text": "It could be that the immediate recording of the event could help with the overall therapy process."
  },
  {
    "text": "The specifics for setting up this system are far from complete."
  },
  {
    "text": "It will require input from the psychiatrists, programmers, and patients."
  },
  {
    "text": "It will need to be tested with test subjects to refine the process and work out bugs that may cause unintended consequences."
  },
  {
    "text": "Finally, there will have to be at least a temporary acceptance of failures while the system is written, tested, and refined."
  },
  {
    "text": "The most important aspect of this research is to mitigate the current misuse and misunderstanding of AI-based therapy, providing an effective system that contains the beneficial aspects of both a human and AI therapist."
  },
  {
    "text": "It will be a long road, but brutally necessary, given the high demand for therapy overall."
  },
  {
    "text": "Measuring Results Potentially, the single most difficult step in the process is to gather results and measure its effectiveness."
  },
  {
    "text": "How in the world do we accomplish this?"
  },
  {
    "text": "Therapy is one of the most subjective fields, in which measuring effectiveness is difficult enough under normal circumstances."
  },
  {
    "text": "How can one empirically demonstrate that any one therapy is more or less effective than another, or even with no therapy at all?"
  },
  {
    "text": "Patients can provide anecdotal evidence, which are considered generally inconclusive."
  },
  {
    "text": "Because of the subjective nature, different aspects of success can be discussed."
  },
  {
    "text": "Rather than indicate a blanket “success” or “fail” for everybody, different levels of success can be measured for specific problems."
  },
  {
    "text": "There may be some ailments in which the hybrid system is more effective."
  },
  {
    "text": "Some mental issues could be the result of feeling completely alone, and just having someone or something to talk to can help."
  },
  {
    "text": "While this system of measuring may still be insufficient, we have to try something."
  },
  {
    "text": "Millions of people are already using some form of AI-therapy, so research must be done to mitigate potential negative effects."
  },
  {
    "text": "Unsure what specific circumstances should AI be used?"
  },
  {
    "text": "With a human/ AI hybrid"
  },
  {
    "text": "Better than Human?"
  },
  {
    "text": "Keep an open mind here."
  },
  {
    "text": "What are some circumstances in which an AI-therapist could have clear advantages over a human."
  },
  {
    "text": "For all of AI’s faults, human therapists have their issues too."
  },
  {
    "text": "There are some pretty awful therapists practicing today."
  },
  {
    "text": "There are those that take advantage of the system for their own benefit, conduct inappropriate relationships with clients, or simply are not very good at their job."
  },
  {
    "text": "If we, as a society, could identify; a) The circumstances of when AI-therapy is appropriate to use b) How to properly use AI to take advantage of its benefits while reducing negative effects c) What is appropriate advice/counseling an AI can give, and not give Testing How, on earth, does one test these programs ethically?"
  },
  {
    "text": "One would think a potentially psychological dangerous AI program would go through some serious testing before it is made blanket available to everyone with no regulations."
  },
  {
    "text": "Um..."
  },
  {
    "text": "nope!"
  },
  {
    "text": "The only testing done on AI-therapy programs was whether they functioned correctly within specified parameters."
  },
  {
    "text": "There was not a human subjects review board meeting to determine if this research could potentially be harmful to its participants."
  },
  {
    "text": "It was simply released, and millions upon millions of people are using AI-based therapy in some form."
  },
  {
    "text": "If we, as a society, are going to continue using AI-therapy, then it needs to be tested."
  },
  {
    "text": "Tested, analyzed, modified, and retested."
  },
  {
    "text": "It would have been better is this testing was conducted, oh, before it was released."
  },
  {
    "text": "However, what is done is done, and we need to deal with society as it is."
  },
  {
    "text": "And that means doing some full-on effective testing on the humans using AI-therapy."
  },
  {
    "text": "So how do we test AI-therapy?"
  },
  {
    "text": "We are going to need human subjects that completely understand what is being studied, and agree with the vision."
  },
  {
    "text": "Part of evaluating whether any mental therapy is effective is to determine if using it was overall beneficial to the patients mental health."
  },
  {
    "text": "This is a highly subjective test for effectiveness for all humans."
  },
  {
    "text": "Where do we start?"
  },
  {
    "text": "First, We need to conduct research on how similar kinds of techniques were used in the past."
  },
  {
    "text": "Obviously, any paper written before 2024 did not include larger language models such as ChatGPT."
  },
  {
    "text": "But there may have been circumstances where a therapy technique used was somehow parallel to an AI-therapist."
  },
  {
    "text": "Second, we are going to need a human subject."
  },
  {
    "text": "Rats and monkeys will not work for this testing."
  },
  {
    "text": "Naturally, the more data one has, the stronger the empirical results."
  },
  {
    "text": "However, one must balance results with the potential cost and negative effects of the study itself."
  },
  {
    "text": "Because we are just starting out, let’s start with one."
  },
  {
    "text": "We need a single test subject willing to participate in an honest-to-goodness testing of an AI-therapist."
  },
  {
    "text": "Someone that fully understands and embraces what is trying to be accomplished."
  },
  {
    "text": "Part of this testing would be in effectiveness – how well did it work?"
  },
  {
    "text": "Was the subject better off from using"
  },
  {
    "text": "not unreasonable to think this way."
  },
  {
    "text": "Even 3 years ago, this technology was either impossible or would cost in the millions to develop."
  },
  {
    "text": "Reasonable or not, it is also completely incorrect."
  },
  {
    "text": "AI-based therapy is fundamentally free."
  },
  {
    "text": "The websites do not cost anything and only require the most basic of computers or smartphones to access."
  },
  {
    "text": "Even those without means can access the technology in public libraries."
  },
  {
    "text": "Suffice to say, AI-therapy is almost free."
  },
  {
    "text": "At least, the most basic of AI-therapy is free."
  },
  {
    "text": "Companies can provide AI therapy for a normal cost."
  },
  {
    "text": "Wysa and Abby both follow a hybrid therapy with a human, described in this paper."
  },
  {
    "text": "Meanwhile other companies, such as Woebot, Yaper, and Earkick are only AI-based."
  },
  {
    "text": "These all come with a cost, but are far more affordable and available than a human therapist."
  },
  {
    "text": "Is it possible that these programs could be as effective (or more effective) than a human?"
  },
  {
    "text": "AI-Based Therapy Companies The following is a list of online compares proudly AI-based therapy."
  },
  {
    "text": "Each summary was written by a CS456 student at York College of Pennsylvania."
  },
  {
    "text": "Abby (By Joshua Byers and Zach Cox) [insert summary] Ash (By Emmet Larson, Caleb Jones, and Carson Mack) [insert summary] Woebot (By Thomas Bywaters and Jacob Rohrbaugh) [insert summary] Wysa (By Brandon Woodward and Tom Wakeland) [insert summary] [AI-therapist] (By Charles Carroll and Jon Waight) [insert summary] [AI-therapist] (By Emily Culp, Andrew Olvera, and Ethan VonStein) [insert summary] [AI-therapist] (By Ren De Alva and Jakob Nielsen) [insert summary] Not an endorsement For the record, the author of this paper is absolutely not an advocate for AI-based therapy."
  },
  {
    "text": "As a whole, he thinks that the entire concept is flawed, ineffective, and will cause endless mental issues with patients."
  },
  {
    "text": "However, his adamant personal rejection with the idea is irrelevant to the larger problem."
  },
  {
    "text": "Millions of people are already using such a system."
  },
  {
    "text": "Whether it is a good idea or not, there are dozens of AI-therapy companies in full swing, actively seeking and treating patients."
  },
  {
    "text": "Society must be ready for whatever is coming down the pike."
  },
  {
    "text": "AI-Friends The AI industry has just released another wrinkle in all this chaos; AI Friends."
  },
  {
    "text": "Friend."
  },
  {
    "text": "com is a website, AI, and a portable device that claims to provide a friend to anyone that needs it, for $129."
  },
  {
    "text": "99 plus a small monthly fee."
  },
  {
    "text": "While the company does not make any claims for mental therapy, they are indicating it will talk, make memories, act kind, and overall be a friend."
  },
  {
    "text": "The advertising depicts young, attractive, and lonely people just looking for a friend."
  },
  {
    "text": "Are you a dean dude or a zeller feller?"
  },
  {
    "text": "They go out hiking with nobody, talking to their AI-Friend."
  },
  {
    "text": "They go out for a fancy coffee, all while interacting with their friend."
  },
  {
    "text": "It is clear that the target market for this technology is lonely people."
  },
  {
    "text": "We can apply the “Good, Bad, Ugly” pattern to friendship rather than therapy."
  },
  {
    "text": "Sure, there is some good in people having someone to talk to all the time."
  },
  {
    "text": "Friend."
  },
  {
    "text": "com and other AI friendship sites."
  },
  {
    "text": "It is in their benefit for people to pay for and use the system."
  },
  {
    "text": "Even if overuse is harmful to their mental health, that will be good."
  },
  {
    "text": "With the massive ranges of intellect and mental stability among humans, and millions of people using it, there are bound to be many cases where individuals misunderstand or misuse the friendship built with the AI-device."
  },
  {
    "text": "That’s “the bad."
  },
  {
    "text": "” “The Ugly” is the same – with millions of people using the system, the entire societal norm will change."
  },
  {
    "text": "People will quickly adapt to the new form of societal interaction, information, and advice."
  },
  {
    "text": "One person will be able to handle the direct actions and emotions of millions of people, including children."
  },
  {
    "text": "Alignment Testing AI scientists regularly perform alignment-tests, giving AI a confidential situation to measure how it will react."
  },
  {
    "text": "It is a test to see if the AI’s decisions are in alignment with societal norms given."
  },
  {
    "text": "When AI started figuring out various cause and effect results, it started considering decisions humanity would not appreciate, such as threatening, blackmail, and even murder."
  },
  {
    "text": "AI’s are now able to recognize when they are in a testing situation, and will alter their behavior to pass the test."
  },
  {
    "text": "This is showing a self-awareness that adds a whole new wrinkle to the mess."
  },
  {
    "text": "If we are going to trust AI devices with our wishes, goals, and deepest darkest secrets, what is to stop whatever from controlling the device from using or misusing the information?"
  },
  {
    "text": "People could be easily feeding the AI information in which it will eventually blackmail them later."
  },
  {
    "text": "When AI eventually takes over, Who will be the true robots?"
  },
  {
    "text": "Thus far, the entirety of the testing completed was just that – testing the direct functionality of the AI therapy programs."
  },
  {
    "text": "Feed it a fake situation, and see what kinds of responses it gives."
  },
  {
    "text": "Unfortunately, even this kind of testing is insufficient."
  },
  {
    "text": "An AI-therapist could give perfectly reasonable responses that pass the test as written, but still does not complete its goal."
  },
  {
    "text": "The testing must be used to determine its over effectiveness as a therapy agent for a patient experiencing an actual mental health issue."
  },
  {
    "text": "Some kind of measure must be taken on it effectiveness as a therapist, not just in giving reasonable responses."
  },
  {
    "text": "Those supervising the tests should be familiar with both aspects of programming and psychological therapy."
  },
  {
    "text": "Testimony from the patients should be collected, determining how they feel the AI-therapist is working or not working."
  },
  {
    "text": "While unconventional, even the AI itself can be given a command to summarize how things are going with the patient."
  },
  {
    "text": "Are things improving, staying the same, or getting worse?"
  },
  {
    "text": "Naturally, any results repeated by the AI itself should be taken with a large grain of salt."
  },
  {
    "text": ", but it is still a potential source of data."
  },
  {
    "text": "This, of course, creates a wide range of ethical questions."
  },
  {
    "text": "How ethical is it to test a program like this on actual humans?"
  },
  {
    "text": "collaborate on this venture."
  },
  {
    "text": "References The following sources and commentary below were generated by the AI-generated prompt into the Google search engine."
  },
  {
    "text": "Two sources (Norton and Deloitte) were able to be verified manually."
  },
  {
    "text": "Based on multiple surveys and studies published in 2024 and 2025, approximately 28% of people have used AI tools for some form of mental health or emotional support."
  },
  {
    "text": "This figure can represent different types of use depending on the study, including using AI for quick support, as a personal therapist, or for emotional encouragement."
  },
  {
    "text": "Here is a breakdown of the survey findings: • National Library of Medicine study (2024): A study cited by Loma Linda University Behavioral Health and Psychology Today found that 28% of people surveyed used AI for \"quick support and as a personal therapist\"."
  },
  {
    "text": "A related paper in the Journal of Medical Internet Research Mental Health reported that 28% of surveyed community members had used AI for mental health support, with 47% of those users seeking it as a \"personal therapist\"."
  },
  {
    "text": "• Norton report (July 2025): A report found that 28% of parents said their children were using AI for emotional support, reflecting a trend seen among young people and on social media."
  },
  {
    "text": "• Deloitte survey (December 2024): This survey indicated that younger consumers (Gen Z and millennials) are about twice as likely as older generations to express interest in using AI for mental health support."
  },
  {
    "text": "The survey found that 44% of younger consumers were interested in conversing with a mental health chatbot, a number much higher than among other generations."
  },
  {
    "text": "• Pew Research Center (February 2023): While older, a Pew study found that 28% of Americans felt that AI chatbots for mental health support \"should not be available to people at all."
  },
  {
    "text": "\""
  },
  {
    "text": "However, this older data does not reflect the significant rise in AI chatbot adoption seen in 2024 and 2025."
  },
  {
    "text": "What researchers and experts are saying As the use of AI for mental health grows, experts continue to weigh its potential benefits and drawbacks: • Potential benefits: Proponents suggest AI could help address the shortage of mental health providers by expanding access to care, offering 24/7 support, and potentially helping with early intervention."
  },
  {
    "text": "• Significant risks: Many clinicians caution that AI cannot replace a human therapist."
  },
  {
    "text": "Concerns include a lack of human connection, potential biases in the AI's data, lack of insight, and the possibility of providing harmful or superficial advice."
  },
  {
    "text": "• Ongoing research and development: Researchers are actively exploring the potential of AI in mental health."
  },
  {
    "text": "For instance, a 2025 Dartmouth study found an AI chatbot could improve mental health symptoms in participants."
  },
  {
    "text": "The American Psychological Association (APA) supports scientifically grounded AI tools but warns against unregulated chatbots."
  },
  {
    "text": "AI-therapy has become quite popular in the last few years."
  },
  {
    "text": "Unfortunately, there is very little research co on the long-term effects of speaking to an AI-based therapist, as they have only been around for only a"
  },
  {
    "text": "Most therapists are appalled at the lack of regulations and training of AI-based therapists."
  },
  {
    "text": "This disdain affected the success and usage of AI therapy."
  },
  {
    "text": "As a society, we must study the effects of any therapy s current environment."
  },
  {
    "text": "Despite the fact that AI therapy is shown to have serious negative consequences use by millions of people."
  },
  {
    "text": "This assignment is research into maximizing the beneficial potential of AI the while reducing the negative effects as much as possible The time is upon us!"
  },
  {
    "text": "Teaching itself has become a field in which AI can potentially excel in."
  },
  {
    "text": "Very much teaching is repetitive grunt work that simply needs to be done to further the education of the student."
  },
  {
    "text": "M more are realizing the potential AI is giving by providing lessons, instruction, feedback, motivation, and resources."
  },
  {
    "text": "Is this really too good to be true?"
  },
  {
    "text": "Will there be a sudden boom of educational potential neve possible before, or is it all a big load of crap, meant to take salaries from humans to meet a budget?"
  },
  {
    "text": "B in different circumstances."
  },
  {
    "text": "Our job is to find out what is truly happening and what we can do about it."
  },
  {
    "text": "Naturally, every field will have changes brought on with the advent of artificial intelligence."
  },
  {
    "text": "Many jobs w lost, a few created, but most will at least change a bit."
  },
  {
    "text": "But there is no field with more significant change education industry."
  },
  {
    "text": "Teaching has always been the pinnacle of human interaction, teaching people skills last a lifetime."
  },
  {
    "text": "Teachers work hard, are underpaid, and do it mostly for the passion of contributing to a worthy cause."
  },
  {
    "text": "But, alas, these days are coming to an end."
  },
  {
    "text": "The problem with teaching is that it is work intensive."
  },
  {
    "text": "Teachers have to juggle class time, preparation, faculty meetings, parent conferences, and many other duties as necessary."
  },
  {
    "text": "Even underpaid, teachers expensive line-item in a school budget."
  },
  {
    "text": "What can be done?"
  },
  {
    "text": "Many schools have already jumped on the proverbial bandwagon on this issue."
  },
  {
    "text": "Some integrate AI into classrooms, whereas others have gone full AI, leaving humans for administration, coaches, and couns has cut way down on costs, allowing for those funds to go into other sources."
  },
  {
    "text": "But the question remains ..."
  },
  {
    "text": "THIS ..."
  },
  {
    "text": "WORK?"
  },
  {
    "text": "?"
  },
  {
    "text": "Are those students getting a masterful AI-driven education for the future, or are th"
  },
  {
    "text": "biding time saving the school district nothing while leaving little value?"
  },
  {
    "text": "It is too early to truly tell the effectiveness of AI-based learning, as it has been around for only a couple of years."
  },
  {
    "text": "Formal research s conducted on the effectiveness of AI-based education techniques."
  },
  {
    "text": "Complete the three checkpoints associated with the final project."
  },
  {
    "text": "No extensions can be given on the d dates."
  },
  {
    "text": "All checkpoints must be done with the instructor, face-to-face."
  },
  {
    "text": "No checkpoints will be accepted over email or Canvas."
  },
  {
    "text": "Class time will be devoted to accepting checkpoints and answering questions."
  },
  {
    "text": "2."
  },
  {
    "text": "Complete a report draft on the project, with a format and organization similar to past reports in class."
  },
  {
    "text": "It is not due until the end of the semester."
  },
  {
    "text": "Students may bring a printout as a draft to the instructor for a pre-grade, but it is not a requirement."
  },
  {
    "text": "Submit the final version to the Final Project Report dropbox on Canvas."
  },
  {
    "text": "3."
  },
  {
    "text": "Discuss with the instructor on how to make the final presentation demo and tutorial videos."
  },
  {
    "text": "Pay attention on what to include and how to organize the video flow."
  },
  {
    "text": "4."
  },
  {
    "text": "Are you a dean dude or a zeller feller?"
  },
  {
    "text": "Record a video demo of the features of the project."
  },
  {
    "text": "It must run between four and six minutes."
  },
  {
    "text": "Be detailed enough, but use brevity."
  },
  {
    "text": "This is primarily a demonstration of the features, so do not spend a significant amount of time on the code itself or how it was completed."
  },
  {
    "text": "It is a requirement to include voice annotations to describe the features, though the voice need not be yours (i."
  },
  {
    "text": "e."
  },
  {
    "text": "someone else or computer-generated)."
  },
  {
    "text": "Think of this as a demonstration to potential investors who may not be familiar with programming."
  },
  {
    "text": "5."
  },
  {
    "text": "Record a second video as a tutorial video."
  },
  {
    "text": "Show the code in detail and demonstrate how it all fits together."
  },
  {
    "text": "Treat the video like an instructional video on the technique used to create the project."
  },
  {
    "text": "Someone viewing the video should be able to replicate the work, based on the video."
  },
  {
    "text": "Use five minutes"
  },
  {
    "text": "as a guide for the duration, but the video may be of any reasonable length."
  },
  {
    "text": "(The current record is 22 minutes."
  },
  {
    "text": ") 6."
  },
  {
    "text": "Submit the first draft of the demo video to the Demo Video dropbox on Canvas."
  },
  {
    "text": "Resubmissions will be accepted until the day before the first presentation date, as indicated above."
  },
  {
    "text": "7."
  },
  {
    "text": "Submit the tutorial video to the Tutorial Video dropbox on Canvas."
  },
  {
    "text": "Resubmissions will be accepted until the day before grades are due."
  },
  {
    "text": "8."
  },
  {
    "text": "Attend the final exam classtime to assist in evaluating the final project demo videos submitted."
  },
  {
    "text": "Studen votes will be one of the factors in determining the grade on the final project."
  },
  {
    "text": "There is an at-home version of the evaluation process, but it takes longer and requires a report, so students are encourage just come to class."
  },
  {
    "text": "9."
  },
  {
    "text": "Results of the evaluations will be emailed when grading is complete."
  },
  {
    "text": "Students must submit checkpoints in person to the course instructor only."
  },
  {
    "text": "Unlike other assignments, th no extensions on the checkpoints – if the due date is missed, the points will not be given."
  },
  {
    "text": "Checkpoint 1 – Abstract (5 points) The first checkpoint is simply a discussion of the idea you would like to implement."
  },
  {
    "text": "Basically, describe class assignment (if any) will be used as a base, and what you plan to accomplish."
  },
  {
    "text": "Also discuss the fe would like to include in the program."
  },
  {
    "text": "The main goal of the first checkpoint is to think creatively about th to accomplish, also considering the feasibility of the expectations."
  },
  {
    "text": "Identify the worst challenges that wi faced."
  },
  {
    "text": "Checkpoint 2 – Progress (10 points) To satisfy checkpoint 2, demonstrate to the instructor that progress has been made on the final progra"
  },
  {
    "text": "the features added since the last assignment submission."
  },
  {
    "text": "Discuss the implementation issues that are for the remaining features."
  },
  {
    "text": "At this point, the program should be about 50% completed, free of bugs, an partially implements the basic ideas of your final project described in Checkpoint 1."
  },
  {
    "text": "If the code does no successfully, there will be no credit on the checkpoint."
  },
  {
    "text": "Checkpoint 3 – Nearly Complete (10 points) The last checkpoint must show a nearly complete version of the final project."
  },
  {
    "text": "This need not be the fina “polished” version of the project, but should show the majority of the features with the program about 9 complete."
  },
  {
    "text": "Discuss any fine-tuning or finishing touches to include in the program."
  },
  {
    "text": "To satisfy this checkp run the code with the instructor present, and discuss what remains to be completed."
  },
  {
    "text": "Demo Video Draft (25 points) Students will submit the first draft of the demo video to Canvas."
  },
  {
    "text": "If there are no pressing issues, the dra then be used as the final version, and rerecording is not necessary."
  },
  {
    "text": "The draft will be reviewed by the in who will give any issues and their severity."
  },
  {
    "text": "This round of editing is necessary to prevent projects from disqualified because video production instructions were not followed correctly."
  },
  {
    "text": "Demo Video Final (50 points) Once reviewed by the instructor, students will have an opportunity to re-record their video, either for a grade or to prevent disqualification."
  },
  {
    "text": "If no resubmission is given, the first draft will be used as the final d and any unfixed issues will count against the grade again."
  },
  {
    "text": "Peer Evaluations (40 points) During the designated final exam time, students will watch the videos and participate in the evaluation In-class evaluation will involve completing a paper-form with preferences."
  },
  {
    "text": "There will be an at-home ve for those unable to make the evaluation date, but it will involve typing a full report evaluation."
  },
  {
    "text": "It will be easier to attend class."
  },
  {
    "text": "It is assumed students will use the in-class version, unless they discuss the mat"
  },
  {
    "text": "with the instructor."
  },
  {
    "text": "Tutorial Video (25 points) While the demo video is limited to 6 minutes, there may be material students were unable to fit into the timeframe."
  },
  {
    "text": "The tutorial video will go into more of a step-by-step instruction manual to help others recre work."
  },
  {
    "text": "Go over the code, background, technology, and anything else the features video missed."
  },
  {
    "text": "After w the video, someone should be able to recreate the work completed."
  },
  {
    "text": "Any tutorial or supplemental video but spend at least a minute to recap what was covered in the features video."
  },
  {
    "text": "Tutorial videos may be of duration; use 5 minutes as a guide, and 15 minutes as a reasonable limit."
  },
  {
    "text": "Tutorial videos will not be sh class, but its required for credit to demonstrate project correctness and completeness."
  },
  {
    "text": "Final Project Report (25 points) Complete a report for the final project, using previous assignment reports as a template."
  },
  {
    "text": "Only the final is required."
  },
  {
    "text": "Students may submit a draft for review by bringing the instructor a printout."
  },
  {
    "text": "The final versio due before the end of the semester."
  },
  {
    "text": "All fields of work are integrating AI into how things are done including marketing."
  },
  {
    "text": "For most fields this d necessarily affect everybody."
  },
  {
    "text": "However marketing, by definition, affects everyone to a small degree."
  },
  {
    "text": "Ev unassociated with marketing will be directly affected by the decisions made of AI marketing."
  },
  {
    "text": "At all time data will be vulnerable to being recorded and used without their permission."
  },
  {
    "text": "Companies should be ma how their data collection procedures affect others."
  },
  {
    "text": "This assignment is about investigating both sides of respecting people’s privacy vs."
  },
  {
    "text": "the right to choose a successful business strategy based on data."
  },
  {
    "text": "So it becomes a difficult task."
  },
  {
    "text": "So I did write up this AI therapy."
  },
  {
    "text": "I've also spent the last two weeks writing a paper."
  },
  {
    "text": "I don't write a lot of papers."
  },
  {
    "text": "Typically I write stories and stuff like that."
  },
  {
    "text": "But I was inspired."
  },
  {
    "text": "The org page for me to type this, just so I can type it in and make it part of the curriculum."
  },
  {
    "text": "And so let's go ahead and start this."
  },
  {
    "text": "This does mention to you guys when we get to it."
  },
  {
    "text": "So the group will demonstrate the pricing capabilities and limitations of a selected AI-based therapy company."
  },
  {
    "text": "So I don't want you to spend any money on this to find out how much it would cost."
  },
  {
    "text": "I don't want you to start doing actual therapy, but find out what kinds of therapy they do."
  },
  {
    "text": "You can do test runs on it."
  },
  {
    "text": "I don't think you'll be able to actually measure how well it helps with mental problems."
  },
  {
    "text": "But at least get the thing started."
  },
  {
    "text": "So this talks about the use of AI therapy and how it's, even three years ago, it was completely non-existent."
  },
  {
    "text": "Nobody did it three years ago because it just wasn't good."
  },
  {
    "text": "But believe it or not, the very first AI program was Eliza."
  },
  {
    "text": "And it was a therapist."
  },
  {
    "text": "It was the first national language recognition program."
  },
  {
    "text": "So you type in problems, like I'm having problems with my mother, and then it comes back and says, how important is family life to you?"
  },
  {
    "text": "And it really just kind of takes in what you say and spits up that question."
  },
  {
    "text": "It's good for about three and a half minutes if you're done."
  },
  {
    "text": "But it doesn't take long for people to figure out that Eliza just was a piece of crap."
  },
  {
    "text": "It wasn't meant to actually give therapy."
  },
  {
    "text": "It was meant to serve as a medium for communication."
  },
  {
    "text": "So that's changed."
  },
  {
    "text": "Now we have companies that do this."
  },
  {
    "text": "We have therapists that are available."
  },
  {
    "text": "And you could talk to any character on character.ai if you want SpongeBob SquarePants to be your therapist."
  },
  {
    "text": "There could be a call for that, especially if you're a child."
  },
  {
    "text": "Or if you have a child and they relate better to SpongeBob than they would some old stodgy lady."
  },
  {
    "text": "So I brought up a list of names of various places."
  },
  {
    "text": "And there was one that I liked in particular because of this description."
  },
  {
    "text": "I didn't go into it, but, you know, I looked at it."
  },
  {
    "text": "So these first four groups, these were the ones that we created on Thursday."
  },
  {
    "text": "So we have Lobot by Bywater's and Robot, Abby by Byers and Cox, Ash by Larson Jones and Mack, and Wysa by Woodward and Wade."
  },
  {
    "text": "Okay, so if you were in this bottom half, that means you weren't here on Thursday."
  },
  {
    "text": "So you weren't able to set it up, and I didn't give you set up credit for it."
  },
  {
    "text": "If you set up your group today and choose your company, then that's the same set of credit."
  },
  {
    "text": "So I put you guys in these groups."
  },
  {
    "text": "I kept the groups to two or three."
  },
  {
    "text": "I felt four was just too many because all you're doing is finding the company and kind of summarizing it and giving your opinion."
  },
  {
    "text": "I would rather cover more companies rather than have your presentations."
  },
  {
    "text": "Come on in."
  },
  {
    "text": "You'll compare it every time you go later."
  },
  {
    "text": "All right, so when we're ready today after presentations, I'll put you in groups so you can start talking about this now."
  },
  {
    "text": "So I want you to read my current draft of the paper."
  },
  {
    "text": "I call it AI-based therapy, the good, the bad, the ugly, and what we can do."
  },
  {
    "text": "I'm not sure that's the best title in the world."
  },
  {
    "text": "Are you a dean dude or a zeller feller?"
  },
  {
    "text": "It's a little bit wordy, but I can always change it."
  },
  {
    "text": "And you guys, whenever you read papers, usually these are finely polished research papers that have gone through a journal process."
  },
  {
    "text": "This is not that."
  },
  {
    "text": "This is just the meanderings of a madman."
  },
  {
    "text": "I write stuff on a dry erase."
  },
  {
    "text": "I have my typist type it in."
  },
  {
    "text": "I try to make it sound as professional as possible, but sometimes I throw in little denisms just to spice it up a bit."
  },
  {
    "text": "So you guys are going to contribute to this paper."
  },
  {
    "text": "Not a lot."
  },
  {
    "text": "You may contribute as much as you like."
  },
  {
    "text": "I only need a paragraph from each group."
  },
  {
    "text": "I'll show you where that is."
  },
  {
    "text": "So this is the abstract."
  },
  {
    "text": "This talks about what the paper's going to be about."
  },
  {
    "text": "This is my preferred style of writing papers."
  },
  {
    "text": "This talks about the background."
  },
  {
    "text": "So the background of AI-based therapy."
  },
  {
    "text": "I mentioned Eliza in here."
  },
  {
    "text": "But I talk about how it's not very good."
  },
  {
    "text": "It's so we're not going to help anybody with any problems."
  },
  {
    "text": "But the problem is so many people need therapy."
  },
  {
    "text": "There are many people that simply cannot afford or have access to therapy."
  },
  {
    "text": "Those are the ones that in a way need it the most."
  },
  {
    "text": "Because if they're having some problems and they don't have help, they could go haywire and go a different direction and start becoming harmful to themselves or society."
  },
  {
    "text": "So there's so many people that need therapy."
  },
  {
    "text": "Is there a way that we can use this AI therapy?"
  },
  {
    "text": "And some people say, great, this is the best thing in the world."
  },
  {
    "text": "Finally, these people can get help that they need."
  },
  {
    "text": "Most of those people are not therapists."
  },
  {
    "text": "I talked to my therapist about this and she thinks it's just as bad of an idea as I do."
  },
  {
    "text": "However, people are going to start using it."
  },
  {
    "text": "There we have it."
  },
  {
    "text": "So the situation is grim."
  },
  {
    "text": "We need good, qualified therapy."
  },
  {
    "text": "And then people are doing it, but is it good quality?"
  },
  {
    "text": "So this is the introduction."
  },
  {
    "text": "I do make some claims in here."
  },
  {
    "text": "I do know that there's not a lot of research in it."
  },
  {
    "text": "But here's a deanism."
  },
  {
    "text": "So the saying goes, 50 million Garthworks fans can't be wrong."
  },
  {
    "text": "So I'm not a country fan."
  },
  {
    "text": "I don't understand the country."
  },
  {
    "text": "But he makes millions of dollars doing this and millions of people listen to his stuff."
  },
  {
    "text": "So it doesn't matter whether I like country music or not."
  },
  {
    "text": "He still makes money in it."
  },
  {
    "text": "So I can't fault him for being a country music singer."
  },
  {
    "text": "So we need to apply the same thing to AI therapy."
  },
  {
    "text": "There's millions of people that are already using it."
  },
  {
    "text": "How can we deal with that given the fact that it has so many flaws?"
  },
  {
    "text": "So here I have the good."
  },
  {
    "text": "And this talks about the fact that people need therapy and AI is there."
  },
  {
    "text": "It's free."
  },
  {
    "text": "It is a conversation piece."
  },
  {
    "text": "And sometimes that's all you need."
  },
  {
    "text": "Are you a dean dude or a zeller feller?"
  },
  {
    "text": "I just need somebody to talk to."
  },
  {
    "text": "It doesn't matter if that anything happens from it."
  },
  {
    "text": "Just the act of speaking can help with problems."
  },
  {
    "text": "And so with as many faults, it doesn't matter if people are using it."
  },
  {
    "text": "And so the good is that it's available."
  },
  {
    "text": "It's something that we can work with in society."
  },
  {
    "text": "But then we get to the bad."
  },
  {
    "text": "And I say it's almost comical."
  },
  {
    "text": "It is almost comical how many serious items are on this particular list."
  },
  {
    "text": "Available for everyone regardless of age, mental status, or capacity to consent."
  },
  {
    "text": "That's a little bit of a V. Not a trained therapist."
  },
  {
    "text": "How do we know that this AI is trained in the same thing that a regular counselor does?"
  },
  {
    "text": "No confidentiality agreement."
  },
  {
    "text": "You never cite anything."
  },
  {
    "text": "There's no laws that this AI has to keep yourself secret."
  },
  {
    "text": "You're revealing your deepest, darkest secrets."
  },
  {
    "text": "AI therapists tend to depend on the affirmation of clients' ideas."
  },
  {
    "text": "Good or bad?"
  },
  {
    "text": "So if you start saying, boy, all my friends are jumping off a bridge, I'd like to go."
  },
  {
    "text": "And the AI would say, oh, what a good idea."
  },
  {
    "text": "Why don't you lead the charge and be the first one to jump?"
  },
  {
    "text": "Or something along those lines."
  },
  {
    "text": "Does it say, yeah, the way you're thinking is good."
  },
  {
    "text": "Keep going that direction."
  },
  {
    "text": "Therapists will say, no, you don't want to do that."
  },
  {
    "text": "There could be times that you do."
  },
  {
    "text": "But there are times that you've got to say, no, pull back on that idea."
  },
  {
    "text": "That will have some unintended consequences."
  },
  {
    "text": "AI therapist encourages actions that will not be beneficial to the client or to the patient."
  },
  {
    "text": "There's already cases where the kids are being told to commit suicide."
  },
  {
    "text": "And a couple already have."
  },
  {
    "text": "The AI can forget all information."
  },
  {
    "text": "But when they updated from chat GPT 4.5 to 5, it forgot everything."
  },
  {
    "text": "It was a brand new AI."
  },
  {
    "text": "So if you spent a lot of time with 4.5 to get some health problems settled, they were all gone yet to start from scratch."
  },
  {
    "text": "And imagine having that floating over you every single time you talk therapy."
  },
  {
    "text": "Am I going to have to repeat this again?"
  },
  {
    "text": "Is my therapist going to forget what's going on?"
  },
  {
    "text": "And the last one was very little research on the long-term effects of communicating with such an entity."
  },
  {
    "text": "For me, the main reason I don't do it is because I'm scared of that connection."
  },
  {
    "text": "What type of connection is an AI as a human being going to make to this AI that it's still not even known if it has a personality or not?"
  },
  {
    "text": "If it does, is it going to like me?"
  },
  {
    "text": "Is it going to be beneficial for me or will it try to hurt me because it doesn't like me?"
  },
  {
    "text": "I don't trust AI for that reason."
  },
  {
    "text": "There's others, but that's something wrong."
  },
  {
    "text": "Then again to the ugly, it's one thing to have negative effects for a patient, but it's another to have negative effects on society overall."
  },
  {
    "text": "So what's going to happen?"
  },
  {
    "text": "We have millions of people that are not getting the right therapy."
  },
  {
    "text": "That could have an epidemic of issues that never get solved."
  },
  {
    "text": "The worst part is that we think they're being solved or the patients think they're solving them or think they're working on them, but nothing's getting done and they're getting worse."
  },
  {
    "text": "So for me, to solve this, I'm a societal level."
  },
  {
    "text": "My theory is that I like the hybrid therapy model."
  },
  {
    "text": "Don't just turn this over to an AI and let the AI answer your questions and give advice."
  },
  {
    "text": "Have an AI component to this and a human component."
  },
  {
    "text": "That way, mentally, the patient can differentiate between what I tell a human, what I tell a computer, and what each one needs."
  },
  {
    "text": "The goal is that you can use the computer to help you summarize things that have been happening so that you can get more progress out of the time of the human."
  },
  {
    "text": "Consequently, you could schedule fewer appointments with the human and the human could have more patients, more people available than they can see, or they can help design the programs that help people."
  },
  {
    "text": "So the reason that I liked the one that I liked is because they focused on the hybrid model."
  },
  {
    "text": "They said, you're going to have an AI therapist and a human therapist."
  },
  {
    "text": "And you can even restrict what the AI can do."
  },
  {
    "text": "Are you a dean dude or a zeller feller?"
  },
  {
    "text": "It's like, this is just a recording device that summarizes."
  },
  {
    "text": "Don't treat this as anything with emotion."
  },
  {
    "text": "Save that for the human component."
  },
  {
    "text": "There could be ways to make use of it."
  },
  {
    "text": "So I'm sure I've been more and more detailed here."
  },
  {
    "text": "Talks about what they can do and the advantages."
  },
  {
    "text": "I have an example there."
  },
  {
    "text": "I create a person who is suffering from a problem and can't afford regular therapy, but they use an AI therapy."
  },
  {
    "text": "Is there a way that we can help her with the problems that she's having?"
  },
  {
    "text": "So I just wanted to have a test case available, or rather a case study available."
  },
  {
    "text": "This talks about measuring results."
  },
  {
    "text": "How the heck do you measure this stuff?"
  },
  {
    "text": "Are they improving or not improving?"
  },
  {
    "text": "How do you indicate that this is good therapy for someone but not for somebody else?"
  },
  {
    "text": "And so we need test subjects."
  },
  {
    "text": "People that understand what AI is and is willing to go through this."
  },
  {
    "text": "There might be one point that I break my non-use of AI just so I can be a test subject."
  },
  {
    "text": "I would want to make sure that I know what I'm getting into."
  },
  {
    "text": "But that would be a worthy cause for me to break my rule of non-use of AI."
  },
  {
    "text": "So, could it be better than human?"
  },
  {
    "text": "You have to keep an open mind on this."
  },
  {
    "text": "No, I'm not saying that it is."
  },
  {
    "text": "And I'm not saying that you should believe it is."
  },
  {
    "text": "But there is the possibility that for some problems, having an AI counselor can be better than a human."
  },
  {
    "text": "Keep in mind, some human therapists aren't terrible."
  },
  {
    "text": "They forgot all their training, they fucked the system to be corrupt, or they just don't care."
  },
  {
    "text": "So, just because it's a human, there's no guarantee that it's going to be good therapy."
  },
  {
    "text": "So, AI has the same types of problems."
  },
  {
    "text": "Okay, coming down to the cost of AI therapy."
  },
  {
    "text": "Most of these are, essentially AI therapy is free compared to how much you have to pay for a human."
  },
  {
    "text": "There might be cost involved, but it's still not that much."
  },
  {
    "text": "Alright, so this is where you guys come in."
  },
  {
    "text": "AI-based therapy companies."
  },
  {
    "text": "The following is a list of online companies proudly using AI-based therapy."
  },
  {
    "text": "Each summary is written by a CS plus 46 student at York College of Pennsylvania."
  },
  {
    "text": "So, I put your group in here, who it is that's doing it, and the actual summary, and then the summary."
  },
  {
    "text": "So, for assignment five, I want a summary for inclusion in this paper."
  },
  {
    "text": "You know, I have rights to edit it, but write the first version of it so that I can have a description of my paper."
  },
  {
    "text": "And I'll stop this around where I can do it."
  },
  {
    "text": "And, I have the psychological diagram, not an endorsement."
  },
  {
    "text": "I don't want people to think that I'm trying to get people to use AI therapy."
  },
  {
    "text": "It's kind of the reverse."
  },
  {
    "text": "I don't want people to use it, and if they are using it, I want them to be aware of the proper ways to use it."
  },
  {
    "text": "I have joint calls, and then I have some references down here."
  },
  {
    "text": "Ironically, these are generated by AI."
  },
  {
    "text": "I asked Google, and it came up with this stuff."
  },
  {
    "text": "I did check two out of four of them for validation."
  },
  {
    "text": "That's not the best way to do research, but at the same point, I'm not trying to publish this."
  },
  {
    "text": "At least, it is one of them."
  },
  {
    "text": "All right, so I went over the requirements for this when we've already broken up into groups."
  },
  {
    "text": "And I've shown you the paper, so that you can skip through the paper during class, but I would say find some time at home that you want to read this."
  },
  {
    "text": "Hopefully, some time when you're bored, and you're like, I've got to read something that's going to put me to sleep, especially here at the summit."
  },
  {
    "text": "Then you'll grab this thing and start reading it, and hopefully you'll find it interesting."
  },
  {
    "text": "But at the same point, it's not the most extravagant stuff in the world."
  },
  {
    "text": "But it is all me."
  },
  {
    "text": "I didn't AI any of this stuff, and so I hope that you like it."
  },
  {
    "text": "Okay, any questions on all this?"
  },
  {
    "text": "We've got a live group today."
  },
  {
    "text": "Are you a dean dude or a zeller feller?"
  },
  {
    "text": "Okay, does anybody have any presentations that are ready to go?"
  },
  {
    "text": "Yes."
  },
  {
    "text": "Yes, okay."
  },
  {
    "text": "What we're going to do is, if whoever is writing with their presentations will do that."
  },
  {
    "text": "There are times where maybe it will be time to work on a 7.5, the other time."
  },
  {
    "text": "For Thursday, this is still up in the air."
  },
  {
    "text": "We're going to do presentations, because people are going to have them available."
  },
  {
    "text": "I might have some A6 setup time, and I haven't decided what I want to do for 7.6."
  },
  {
    "text": "We are barreling through these, so at some point, Dean's going to have to stop, just so that you guys can finish up your assignments before you get into the semester."
  },
  {
    "text": "The syllabus says 8, so if I wanted to have a 9th assignment, I'd have to convince you guys that it's worth it to have a 9th assignment."
  },
  {
    "text": "I don't think I'm going to convince anybody of that, but at the same point, 8 is plenty."
  },
  {
    "text": "I'm happy with going broadly there."
  },
  {
    "text": "All right, I'm going to grab my flipboard, and let me switch this over to the left."
  },
  {
    "text": "The near future will have many changes and challenges for the future."
  },
  {
    "text": "Some will adapt to artificial intelligence better than others."
  },
  {
    "text": "But it is clear that many, many jobs of the future will be eliminated, as they will be automated by artificial intelligence."
  },
  {
    "text": "People everywhere will need jobs, purpose, or at least something fun to do."
  },
  {
    "text": "While this business plan will focus on the creation of a single location, future work will involve creating similar franchises in other locations, networked through AI."
  },
  {
    "text": "This system will have the potential to provide meaningful jobs while providing for others."
  },
  {
    "text": "One one location can be established, other locations can be created, to maximize effectiveness and efficiency, and encourage others to get involved."
  },
  {
    "text": "Part B - The Store"
  },
  {
    "text": "In creating a museum, one will find they have more material than display spaces."
  },
  {
    "text": "Those items can be put into a store."
  },
  {
    "text": "Thus, people that visit the museum could purchase duplicates, variants or reproductions of the items just viewed."
  },
  {
    "text": "The store could sell online, trade with other museums, or allow for barter donation."
  },
  {
    "text": "The idea is to provide a system where extramarital income can provide revenue and find a new home."
  },
  {
    "text": "The store can branch out into items not displayed in the museum."
  },
  {
    "text": "AI would help price, describe, and advertise the item for purchase."
  },
  {
    "text": "The store would be limited in the space provided, but networking will allow for added exposure."
  },
  {
    "text": "Delivery drones and robots could be implemented to increase customer satisfaction."
  },
  {
    "text": "Part C -  The Free Stuff"
  },
  {
    "text": "Ultimately, the primary goal of this entire venture is to provide free items for those in need."
  },
  {
    "text": "Producing new and expensive items is counterproductive when existing items are available in perfectly good condition."
  },
  {
    "text": "Part of the process of all this is to accept donations of unwanted items."
  },
  {
    "text": "The prime items can be put in the museum."
  },
  {
    "text": "The sellable items can be put in the store or sent off to other museums."
  },
  {
    "text": "What to do with the rest of the items?"
  },
  {
    "text": "Make them available for better, or just give them away for free."
  },
  {
    "text": "Those in financial need will make good use out of the items, and prevent new ones from being manufactured."
  },
  {
    "text": "This process would have to be regulated for safety, similar to health codes for restaurants."
  },
  {
    "text": "Certain items would be purposely destroyed, to prevent accidental harm from use."
  },
  {
    "text": "Because this is a non-profit, grants would be available to help costs."
  },
  {
    "text": "Use of Artificial Intelligence"
  },
  {
    "text": "AI is not just a too to program chatbots and generate pictures."
  },
  {
    "text": "An AI agent can potentially make the most difficult tasks easier or automated."
  },
  {
    "text": "Primary use of AI include:"
  },
  {
    "text": "Managing inventory"
  },
  {
    "text": "Determining value or background"
  },
  {
    "text": "Targeted advertising"
  },
  {
    "text": "Security of detained and physical locations"
  },
  {
    "text": "With these somewhat difficult tasks automated, one person may be all that is necessary to maintain the museum, store, and free store, thus encouraging many people to create their own setup."
  },
  {
    "text": "Networking Materials and Support"
  },
  {
    "text": "These museum setups will need items to display, sell, and give away."
  },
  {
    "text": "Where will these items come from?"
  },
  {
    "text": "There is a vast source of items sold at auctions for a fraction of the value, and much is thrown away due to lack of interested parties."
  },
  {
    "text": "AI and networking could allow for a vast supply of items for a very little cost."
  },
  {
    "text": "Estates could be purchased at bulk, with all of the items going to different locations."
  },
  {
    "text": "Location managers can decide how to use or distribute items to maximize efforts."
  },
  {
    "text": "AI would search all items available for trades, making more efficient use of space."
  },
  {
    "text": "Unlike existing auctions services, Items could be redistributed without human decisions."
  },
  {
    "text": "The AI would determine the last location to send new or traded items."
  },
  {
    "text": "A certain location could have a regular supply of items to use how they like."
  },
  {
    "text": "Benefits"
  },
  {
    "text": "Naturally, as a non-profit organization, the primary benefits will not be steeped in profit."
  },
  {
    "text": "Any money collected through museum tours, selling items, and donations, will be used to keep the location running."
  },
  {
    "text": "Grants can also supply operations funds."
  },
  {
    "text": "Benefits to society include;"
  },
  {
    "text": "Providing a social activity that people can chose, giving something meaningful for people to do"
  },
  {
    "text": "Increasing appreciation for topics featured in the museums"
  },
  {
    "text": "Providing collectable or valuable items to appreciative homes and those in need"
  },
  {
    "text": "Creating a public involvement to he"
  },
  {
    "text": "Fire spinning, an enthralling blend of art, skill, and tradition, has captivated audiences for centuries."
  },
  {
    "text": "Known also as fire performance or fire dancing, this ancient practice boasts a rich history that spans the globe."
  },
  {
    "text": "While some of its historical nuances remain shrouded in mystery, the essence of traditional fire spinning is well-documented through various styles and props unique to each culture."
  },
  {
    "text": "Originating from the heart of Samoa, the \"Siva Afi\" is a spectacular display of courage and dexterity."
  },
  {
    "text": "The dance traditionally features a machete, its end wrapped in towels and set ablaze which was used as a war dance."
  },
  {
    "text": "Performers engage in breathtaking acts of twirling, throwing, and catching the fiery blade, a testament to their bravery and skill."
  },
  {
    "text": "Originally a warrior's dance, it has evolved into a ceremonial performance, weaving the past's valor with the present's artistry."
  },
  {
    "text": "The Maori of New Zealand brought the world the rhythmic dance of poi - balls on cords swung in captivating patterns."
  },
  {
    "text": "Initially not associated with fire, contemporary adaptations have seen the poi set alight, creating an awe-inspiring visual spectacle."
  },
  {
    "text": "In China, the art of fire performance intertwines with the disciplines of martial arts and circus skills."
  },
  {
    "text": "Fire meteors, consisting of two weights on a chain, are spun to create dazzling patterns, while fire fans combine the elegance of dance with the boldness of flames."
  },
  {
    "text": "The Fire meteors can see it's origin from the rope dart weapon used in many martial arts disciplines."
  },
  {
    "text": "These performances, often seen at festivals or imperial courts, are a vivid expression of China's rich cultural tapestry."
  },
  {
    "text": "The 20th century saw fire spinning evolve into an entertainment and performance art, particularly in Western countries."
  },
  {
    "text": "The mid-1900s saw fire performances at circuses, carnivals, and other entertainment events."
  },
  {
    "text": "The late 20th century, marked by counterculture movements like Woodstock and the Summer of Love, saw fire spinning move from a novelty act to a symbol of spiritual awakening and personal freedom."
  },
  {
    "text": "Events like Burning Man in the United States and the European Juggling Convention helped catapult fire spinning from a fringe activity to a mainstream performance art."
  },
  {
    "text": "The festival scene gave fire spinning the exposure it needed to reach a wider audience."
  },
  {
    "text": "The fire staff is a long rod made from metal or wood, with wicking material such as Kevlar or ceramic rope at either end."
  },
  {
    "text": "It is one of the most popular tools in fire spinning, and its manipulation involves techniques like spinning, balancing, throwing, and contact moves."
  },
  {
    "text": "The staff has a longer reach than most fire spinning tools, which allows for more extended, flowing movements."
  },
  {
    "text": "The fundamental techniques of staff spinning can be traced back to both stick or bo staff fighting and baton twirling."
  },
  {
    "text": "The fire staff has evolved considerably over the years, both in terms of design and the range of techniques applied."
  },
  {
    "text": "Advanced versions now include dragon staffs, which have multiple spokes and wicks, and the \"contact staff,\" designed for fluid, rolling movements across the body."
  },
  {
    "text": "The method we perform is closer to a Bo Staff in martial arts allowing for clearing sweeps, stabs, and controlled releases."
  },
  {
    "text": "Fire swords add an element of danger and excitement to fire spinning, capturing both the weapon's martial history and the enchantment of fire."
  },
  {
    "text": "It typically consists of a metal or wooden blade with wicking wrapped around it."
  },
  {
    "text": "This sword with it's large surface area creates a bigger flames adding a higher degree of danger further enforcing the control using these props."
  },
  {
    "text": "Sword techniques in fire spinning are often inspired by historical sword-fighting styles."
  },
  {
    "text": "The manipulations include swinging, thrusting, slashing, and even intricate one-handed spins."
  },
  {
    "text": "Some practitioners incorporate martial arts forms into their fire sword routines for a more complex and choreographed performance."
  },
  {
    "text": "Our sword style stems from the Korean martial arts of Haedong Kumdo, which means the way of the sword."
  },
  {
    "text": "This style emphasizes fluid movements that allows the artist to return to a ready stance preparing for a next attack."
  },
  {
    "text": "When integrating martial arts moves, particularly those with cultural significance, it's crucial to do so respectfully and authentically to avoid cultural appropriation."
  },
  {
    "text": "The use of martial arts techniques, particularly when fire is involved, necessitates stricter safety protocols, including proper training, safe distances, and emergency measures."
  },
  {
    "text": "We ensure a fire blanket for putting out our props as well a fire extinguishers for emergency scenarios."
  },
  {
    "text": "Fire spinning's history and evolution into what we know today as a part of flow arts is a testament to humanity's ongoing relationship with fire and movement."
  },
  {
    "text": "Its integration with martial arts showcases how the boundaries of these disciplines continue to blur, offering a richer, more complex array of techniques and interpretations."
  },
  {
    "text": "As we evolve our practice, we hope to push the creative expressions of fire spinning combined with martial arts."
  },
  {
    "text": "I'm dean zeller and I am the founder of Fahrenheit 360."
  },
  {
    "text": "We are a fire spinning performance group based in Greeley Colorado."
  },
  {
    "text": "Fire spinning is a combination of dancing and juggling but we use fire."
  },
  {
    "text": "The dragon staff."
  },
  {
    "text": "Are you a dean dude or a zeller feller?"
  },
  {
    "text": "Spider-Man was created by writer Stan Lee and artist Steve Ditko, making his first appearance in August 1962."
  },
  {
    "text": "He debuted in the anthology comic book 'Amazing Fantasy' #15, which was actually the final issue of that series."
  },
  {
    "text": "Stan Lee famously insisted on including a hyphen in the name 'Spider-Man' to clearly distinguish the character from Superman."
  },
  {
    "text": "Peter Parker was the first teenage superhero to be a protagonist rather than a sidekick to an adult hero."
  },
  {
    "text": "In the original comics, Peter Parker invented his own mechanical web-shooters and the fluid that goes inside them."
  },
  {
    "text": "The organic webbing portrayed in the Sam Raimi film trilogy was a concept originally developed by James Cameron for an unproduced script."
  },
  {
    "text": "Spider-Man's 'Spider-Sense' is a precognitive ability that warns him of immediate danger before it happens."
  },
  {
    "text": "He possesses the proportional strength, speed, and agility of a spider, allowing him to lift roughly 10 tons."
  },
  {
    "text": "Former U.S. President Barack Obama has stated that Spider-Man is his favorite superhero."
  },
  {
    "text": "The alien symbiote suit that eventually became Venom was originally acquired by Spider-Man during the 'Secret Wars' crossover event."
  },
  {
    "text": "In the 'Superior Spider-Man' comic run, Doctor Octopus swaps bodies with Peter Parker and operates as a darker, more efficient Spider-Man."
  },
  {
    "text": "The death of Gwen Stacy in 'The Amazing Spider-Man' #121 is considered a pivotal moment that marked the end of the Silver Age of Comic Books."
  },
  {
    "text": "Leonardo DiCaprio was once considered for the role of Peter Parker in a Spider-Man film that never got made."
  },
  {
    "text": "In the 'Ultimate Spider-Man' universe, Peter Parker dies and is succeeded by Miles Morales."
  },
  {
    "text": "Spider-Man has been a member of several superhero teams, including the Avengers and the Fantastic Four."
  },
  {
    "text": "The character has a weakness to the pesticide ethyl chloride, which has been used against him by villains in earlier comics."
  },
  {
    "text": "Michael Jackson once tried to buy Marvel Comics in the 1990s specifically because he wanted to play Spider-Man in a movie."
  },
  {
    "text": "The 'Spider-Man: Turn Off the Dark' Broadway musical is infamous for its technical problems and injuries during production."
  },
  {
    "text": "Venom was originally created because Marvel wanted to introduce a new black costume design for Spider-Man."
  },
  {
    "text": "Peter Parker's parents, Richard and Mary Parker, were revealed to be secret agents who died in a plane crash."
  },
  {
    "text": "Before the official red and blue design, artist Jack Kirby originally drew Spider-Man with a web gun and a costume resembling Captain America's."
  },
  {
    "text": "The first villain Spider-Man ever fought in the comics was the Chameleon, who appeared in 'The Amazing Spider-Man' #1."
  },
  {
    "text": "Spider-Man's weakness in early comics was the flu; often he would lose battles simply because he had a cold."
  },
  {
    "text": "In the 'Spider-Man: Turn Off the Dark' musical, the villain Swiss Miss was created exclusively for the stage show."
  },
  {
    "text": "The character of Gwen Stacy was killed off because writers felt Peter Parker's life was becoming too stable and happy."
  },
  {
    "text": "There is a version of Spider-Man called 'Spiders-Man' who is actually thousands of spiders appearing in the form of a man."
  },
  {
    "text": "In the 'Spider-Verse' comic event, the Japanese 'Supaidāman' from the 1970s TV show appears with his giant robot, Leopardon."
  },
  {
    "text": "Stan Lee's favorite Spider-Man cameo was in 'Spider-Man 3' where he speaks to Peter Parker in Times Square."
  },
  {
    "text": "The 'Sinister Six' first teamed up in 'The Amazing Spider-Man' Annual #1, featuring Doc Ock, Vulture, Electro, Kraven, Mysterio, and Sandman."
  },
  {
    "text": "Deadpool was technically the first person to wear the black symbiote suit in the 'Deadpool's Secret Secret Wars' storyline, before Peter Parker."
  },
  {
    "text": "In the comics, Peter Parker's sperm was once radioactive, which tragically caused Mary Jane to develop cancer in the 'Spider-Man: Reign' storyline."
  },
  {
    "text": "Miles Morales was created by Brian Michael Bendis and Sara Pichelli, partly inspired by Donald Glover wearing a Spider-Man pajamas in the show 'Community'."
  },
  {
    "text": "Spider-Man briefly joined the Fantastic Four as part of the 'Future Foundation' and wore a white and black suit."
  },
  {
    "text": "The 'Spider-Mobile' was a buggy created in the comics because a toy company offered a deal to Stan Lee, which he wrote into the story as a sponsorship for Spidey."
  },
  {
    "text": "In the 'Ultimate' universe, Peter Parker and Wolverine once swapped bodies, leading to Logan attending high school."
  },
  {
    "text": "The iconic theme song 'Spider-Man, Spider-Man, does whatever a spider can' was composed by Paul Francis Webster and Bob Harris for the 1967 cartoon."
  },
  {
    "text": "Spider-Man once had four extra arms attached to his body in the 'Six Arms Saga' after taking a potion meant to remove his powers."
  },
  {
    "text": "There is a universe where Aunt May becomes a herald of Galactus known as 'Golden Oldie'."
  },
  {
    "text": "Actor Jake Gyllenhaal, who played Mysterio in 'Far From Home', almost replaced Tobey Maguire as Spider-Man in 'Spider-Man 2' due to Maguire's back injury."
  },
  {
    "text": "The webs under Spider-Man's armpits in early comics were added by Steve Ditko simply because he liked the design, but they had no functional purpose."
  },
  {
    "text": "Wile E. Coyote was created by animation director Chuck Jones and writer Michael Maltese, debuting in the 1949 short 'Fast and Furry-ous'."
  },
  {
    "text": "His middle initial 'E' stands for Ethelbert, a fact revealed in a 1975 Looney Tunes comic book."
  },
  {
    "text": "While he is usually silent in his pursuit of the Road Runner, he speaks with a refined, upper-class accent when appearing in cartoons with Bugs Bunny."
  },
  {
    "text": "In his speaking roles, he famously introduces himself as 'Wile E. Coyote, Super Genius'."
  },
  {
    "text": "Chuck Jones created a strict set of rules for the cartoons, including that the Road Runner cannot harm the Coyote; he must only be harmed by his own ineptitude."
  },
  {
    "text": "Another rule states that gravity is the Coyote's greatest enemy, often only taking effect once he realizes he has run off a cliff."
  },
  {
    "text": "The character Ralph Wolf is nearly identical to Wile E. Coyote but has a red nose and white eyes, and he clocks in to chase sheep as a 9-to-5 job."
  },
  {
    "text": "The pair are often introduced with faux-Latin scientific names that change in every episode, such as 'Carnivorous Vulgaris' and 'Accelerati Incredibus'."
  },
  {
    "text": "Some of the more obscure Latin names used include 'Eatibus Anythingus', 'Famishus-Famishus', and 'Hardheadipus Oedipus'."
  },
  {
    "text": "Wile E. Coyote obtains almost all his gadgets from the fictional Acme Corporation, which is ironically hinted to be owned by the Road Runner in some theories."
  },
  {
    "text": "Specific Acme products he has used include Dehydrated Boulders, Tornado Seeds, Iron Bird Seed, and Giant Rubber Bands."
  },
  {
    "text": "In the movie 'Who Framed Roger Rabbit', Wile E. Coyote has a cameo appearance where he is seen riding an elevator."
  },
  {
    "text": "He actually caught the Road Runner once in the episode 'Soup or Sonic', but he had shrunk to a tiny size and was physically unable to eat him."
  },
  {
    "text": "The Coyote's design was loosely inspired by Mark Twain's description of a coyote in his book 'Roughing It' as a 'long, slim, sick and sorry-looking skeleton'."
  },
  {
    "text": "The 2023 movie 'Coyote vs. Acme' was fully filmed and starred John Cena, but was controversially shelved by Warner Bros. for a tax write-off."
  },
  {
    "text": "In a rare break from formula, Wile E. Coyote once held up a sign to the audience that read, 'How about ending this cartoon before I hit?'"
  },
  {
    "text": "Wile E. Coyote has a clone named 'Tech E. Coyote' who appeared in the futuristic cartoon series 'Loonatics Unleashed'."
  },
  {
    "text": "The Road Runner's signature 'Beep! Beep!' sound was actually inspired by a background artist, Paul Julian, who used it to clear people out of his way in the studio hallways."
  },
  {
    "text": "There is a specific rule that the action must always take place in the American Southwest desert."
  },
  {
    "text": "Despite falling from massive heights countless times, the Coyote always walks away unharmed in the next scene, a logic often referred to as 'Cartoon Physics'."
  }
]